function validate() {
    //console.log('TODO:...');
    let email = document.getElementById("email");
//взимам елемента където ще се въвежда имейла
    const pattern = /([a-z]+@[a-z]+.[a-z]+)/;
//създавам регекс който ще проверява съвпада ли въведения имейл
//този регекс покрива само да е от малки букви във формат
//<name>@<domain>.<extension>

    email.addEventListener('change', changing);
// добавяме евент change който се активира когато потребителя промени
//стойноста в елемента към който е добавен, но се активира само при 
//натиснат ентър(в случая на задачата), но ако използвам input вместо
//change при първата въведена буква индикира и работи динамично като
// оцветяването се премахва веднага щом регекса мачне.
    function changing (){
        if(!email.value.match(pattern)){
    // във самата функция се опитваме да match-нем въведения имейл към
    // регекса ако не се match-не към атрибутите на тага добавяме нов
    //който сигнализира на CSS да оцвети полето в червено  
            email.classList.add('error');
            return;
        }
    // ако match-не премахваме атрибута с който оцветяваме полето
        email.classList.remove('error');
    }
} 