function solution(number){
// подаваме число number което ползваме във функцията която връщаме
//във тази функция сме подали друго число num което съществува само в 
//обхвата на горната функция като може и да не се декларира
//и стойността на num се пази някъде там
    return function (num){
        return (num += number);
    }
}
//тук сме присвоили функцията на друга като сме подали число
//това число се прибавя към num и за новата функция за num се запазва тази стойност
//и при следващо извикване подаденото число се събира с num и това е резултата
//или при първо извикване num е 0, но сме подали число при създаване на новата функция
//и за тази функция num = 5 и всяко следващо извикване със число ще се събира с 5 
let add5 = solution(5);
console.log(add5(2));
console.log(add5(3));
